Merge pull request #3 from bpringe/convert_ascii_architecture_diagram_to_mermaid
Convert ASCII architecture diagram to mermaid
